In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('/Users/jiangna/Desktop/fire.csv')

In [6]:
df.head()

   FID   Latitude  Longitude
0    0  40.703466 -74.007538
1    1  40.710072 -74.012523
2    2  40.710048 -74.005245
3    3  40.715463 -74.005938
4    4  40.719759 -74.006678

In [7]:
df['coord'] = '0'

In [8]:
df[:3]

   FID   Latitude  Longitude coord
0    0  40.703466 -74.007538     0
1    1  40.710072 -74.012523     0
2    2  40.710048 -74.005245     0

In [9]:
df['coord'] = df.apply(lambda x:'(%s,%s)' % (x['Latitude'],x['Longitude']),axis=1)

In [10]:
df.head()

   FID   Latitude  Longitude                           coord
0    0  40.703466 -74.007538          (40.703466,-74.007538)
1    1  40.710072 -74.012523          (40.710072,-74.012523)
2    2  40.710048 -74.005245          (40.710048,-74.005245)
3    3  40.715463 -74.005938          (40.715463,-74.005938)
4    4  40.719759 -74.006678  (40.719759,-74.00667800000001)

In [11]:
df.to_csv('/Users/jiangna/Desktop/fire_coor.csv')

In [30]:
work_tb['Coord']='0'

In [31]:
work_tb['Coord']=work_tb.apply(lambda x:'(%s,%s)' % (x['long'],x['lat']),axis=1)

In [32]:
work_tb[:3]

,Unnamed: 0,wrkID,long,lat,rdID,geometry,Coord
0,0,36061010000w1008,-73.971243,40.760937,153710,MULTIPOINT (-73.971243 40.760937),"(-73.971243,40.760937)"
1,1,36061010000w1013,-73.971243,40.760937,153710,MULTIPOINT (-73.971243 40.760937),"(-73.971243,40.760937)"
2,2,36061010000w1017,-73.971243,40.760937,153710,MULTIPOINT (-73.971243 40.760937),"(-73.971243,40.760937)"

In [36]:
hos_tb['Coord']= hos_tb['geometry']

In [37]:
hos_tb[:3]

,Hospital,Latitude,Longitude,geometry,Coord
0,Bronx Lebanon Hospital Center 1650 Grand Conco...,40.843396,-73.911038,"(-73.9110377,40.8433956)","(-73.9110377,40.8433956)"
1,"Calvary Hospital 1740 Eastchester Road Bronx, ...",40.848008,-73.844049,"(-73.8440486,40.8480084)","(-73.8440486,40.8480084)"
2,Jacobi Medical Center Pelham Parkway South and...,40.856029,-73.846363,"(-73.8463633,40.8560285)","(-73.8463633,40.8560285)"

In [38]:
hos_tb.to_csv('hos_with_coor.csv')

In [40]:
work_tb.to_csv('work_with_coor.csv')